In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
import numpy as np

In [2]:
engine= create_engine('postgresql://postgres:Welkom01!@10.30.1.10:5432/POC')

In [3]:
engine.table_names()

['locatie',
 'satelliet',
 'meting',
 'boor_locatie',
 'pnt_locatie',
 'pnt_boor_locatie']

In [4]:
df= pd.read_sql(
"""
select *
from meting
limit 20;
""",engine)

In [5]:
df.head()

         id          pnt_id       datum  meting sat_id
0  11057338  L379845P180823  2017-06-07 -0.0077      6
1  11057339  L379845P180823  2017-07-01 -0.0127      6
2  11057340  L379845P180823  2017-07-25 -0.0072      6
3  11057341  L379845P180823  2017-08-18 -0.0151      6
4  11057342  L379845P180823  2017-09-11 -0.0133      6

In [6]:
df1= pd.read_sql(
"""
select *
from locatie
limit 20;
""",engine)

In [8]:
df1.head()

   id          pnt_id    pnt_lat   pnt_lon    locatie
0   1  L373252P179009  52.283131  6.453700  Rodenmors
1   2  L373223P179007  52.283073  6.453774  Rodenmors
2   3  L373257P178125  52.282494  6.448001  Rodenmors
3   4  L373264P179019  52.283166  6.453776  Rodenmors
4   5  L373287P179037  52.283219  6.453800  Rodenmors

In [10]:
df2= pd.read_sql(
"""
select *
from pnt_locatie
limit 20;
""",engine)

In [11]:
df2.head()

     l_id          pnt_id    pnt_lat   pnt_lon  locatie
0  939168  L157935P147880  52.297483  6.815528  Hasselo
1  939169  L158010P148075  52.297465  6.814219  Hasselo
2  939170  L158055P148035  52.297337  6.814447  Hasselo
3  939171  L158105P147935  52.297153  6.815061  Hasselo
4  939172  L158125P148010  52.297165  6.814565  Hasselo